===
unit type
===
fn test() {
  ()
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (unit))))

===
boolean true
===
fn test() {
  true
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (boolean))))

===
boolean false
===
fn test() {
  false
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (boolean))))

===
byte literal
===
fn test() {
  b'\xff'
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (byte))))

===
char literal
===
fn test() {
  'a'
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (char))))

===
integer literal
===
fn test() {
  42
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (integer))))

===
float literal
===
fn test() {
  3.1418
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (float))))

===
static string
===
fn test() {
  "Hello World"
}
---
(source_file
  (fn_declaration
    (identifier)
    (parameter_list)
    (block
      (static_string))))
