===
unit type
===
();
---
(source_file
  (expression_statement
    (unit)))

===
boolean true
===
true;
---
(source_file
  (expression_statement
    (boolean)))

===
boolean false
===
false;
---
(source_file
  (expression_statement
    (boolean)))

===
byte literal
===
b'\xff';
---
(source_file
  (expression_statement
    (byte)))

===
char literal
===
'a';
---
(source_file
  (expression_statement
    (char)))

===
integer literal
===
42;
---
(source_file
  (expression_statement
    (integer)))

===
float literal
===
3.1418;
---
(source_file
  (expression_statement
    (float)))

===
static string
===
"Hello World";
---
(source_file
  (expression_statement
    (static_string)))
