===
Simple Return Statement
===

return 42;

---

(source_file
  (return_statement
    (integer)))

===
Empty Return Statement
===

return;

---

(source_file
  (return_statement))

===
Return with Expression
===

return a + b * c;

---

(source_file
  (return_statement
    (binary_expression
      left: (path
        (identifier))
      right: (binary_expression
        left: (path
          (identifier))
        right: (path
          (identifier))))))

===
Complex Return Statement
===

return (a + b) * (c - d) || e && f;

---

(source_file
  (return_statement
    (binary_expression
      left: (binary_expression
        left: (parenthesized_expression
          (binary_expression
            left: (path
              (identifier))
            right: (path
              (identifier))))
        right: (parenthesized_expression
          (binary_expression
            left: (path
              (identifier))
            right: (path
              (identifier)))))
      right: (binary_expression
        left: (path
          (identifier))
        right: (path
          (identifier))))))
